price = 0
while True: 
    try: # t_n == Tickets number
        t_n = int(input('Введите кол-во билетов: '))
        if type(t_n) == int:
            break
    except ValueError:
        print('Введите целое число! ')
for t in range(t_n):
    t += 1
    while True:
        try: # a_o_t == Age of tickets
            a_o_t = int(input(f'Возраст билета №{t} ')) 
            if a_o_t < 18:
                print('Билет бесплатный!')
            elif 18 <= a_o_t < 25:
                price += 990
                print('Стоимость билета: 990руб.')
            else:
                price += 1390
                print('Стоимость билета: 1390руб.')
            if type(a_o_t) == int:
                break
        except ValueError:
            print('Введите целое число! ')
if t_n  > 3: # Условие скидки при покупке больше 3 билетов
    price = price - (price * 0.1)
    print(f'Сумма к оплате {price}руб. 10% скидка за регистрацию больше 3 человек.')
else:
    print(f'Сумма к оплате {price}руб.')



#_____________________________________________________________________________________
# Есть баг, можем взять три бесплатных билета и получим 10% скидку на единственный платный билет =)

# На мой взгляд корректное условие скидки должно быть таким:
# За привышение минимальной суммы мы получим скидку

# if price  > 990 * 3:
#     price = price - (price * 0.1)
#     print(f'Сумма к оплате {price}руб. 10% скидка за регистрацию больше 3 человек.')
# else:
#     print(f'Сумма к оплате {price}руб.')